Kbdeir/ESPRelayNode/lib/WireGuard-ESP32/src/WireGuard.cpp
/*
 * WireGuard implementation for ESP32 Arduino by Kenta Ida (fuga@fugafuga.org)
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "WireGuard-ESP32.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"

#include "lwip/err.h"
#include "lwip/sys.h"
#include "lwip/ip.h"
#include "lwip/netdb.h"
#include "lwip/tcpip.h"

#include "esp32-hal-log.h"

extern "C" {
#include "wireguard.h"
#include "wireguardif.h"
#include "wireguard-platform.h"
}

// Wireguard instance
static struct netif wg_netif_struct = {0};
static struct netif *wg_netif = NULL;
static struct netif *previous_default_netif = NULL;
static uint8_t wg_peer_index = WIREGUARDIF_INVALID_INDEX;

#define TAG "[WireGuard] "

bool WireGuard::begin(const IPAddress& localIP, const char* privateKey, const char* remotePeerAddress, const char* remotePeerPublicKey, uint16_t remotePeerPort) {
	struct wireguardif_init_data wg;
	struct wireguardif_peer peer;
	ip_addr_t ipaddr = IPADDR4_INIT(static_cast<uint32_t>(localIP));
	ip_addr_t netmask = IPADDR4_INIT_BYTES(255, 255, 255, 255);
	ip_addr_t gateway = IPADDR4_INIT_BYTES(0, 0, 0, 0);

	assert(privateKey != NULL);
	assert(remotePeerAddress != NULL);
	assert(remotePeerPublicKey != NULL);
	assert(remotePeerPort != 0);

	// Setup the WireGuard device structure
	wg.private_key = privateKey;
    wg.listen_port = remotePeerPort;
	
	wg.bind_netif = NULL;

	// Initialise the first WireGuard peer structure
	wireguardif_peer_init(&peer);
	// If we know the endpoint's address can add here
	bool success_get_endpoint_ip = false;
    for(int retry = 0; retry < 5; retry++) {
        ip_addr_t endpoint_ip = IPADDR4_INIT_BYTES(0, 0, 0, 0);
        struct addrinfo *res = NULL;
        struct addrinfo hint;
        memset(&hint, 0, sizeof(hint));
        memset(&endpoint_ip, 0, sizeof(endpoint_ip));
        if( lwip_getaddrinfo(remotePeerAddress, NULL, &hint, &res) != 0 ) {
			vTaskDelay(pdMS_TO_TICKS(2000));
			continue;
		}
		success_get_endpoint_ip = true;
        struct in_addr addr4 = ((struct sockaddr_in *) (res->ai_addr))->sin_addr;
        inet_addr_to_ip4addr(ip_2_ip4(&endpoint_ip), &addr4);
        lwip_freeaddrinfo(res);

        peer.endpoint_ip = endpoint_ip;
        log_i(TAG "%s is %3d.%3d.%3d.%3d"
			, remotePeerAddress
            , (endpoint_ip.u_addr.ip4.addr >>  0) & 0xff
            , (endpoint_ip.u_addr.ip4.addr >>  8) & 0xff
            , (endpoint_ip.u_addr.ip4.addr >> 16) & 0xff
            , (endpoint_ip.u_addr.ip4.addr >> 24) & 0xff
            );
		break;
    }
	if( !success_get_endpoint_ip  ) {
		log_e(TAG "failed to get endpoint ip.");
		return false;
	}
	// Register the new WireGuard network interface with lwIP
	LOCK_TCPIP_CORE();
	wg_netif = netif_add(&wg_netif_struct, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gateway), &wg, &wireguardif_init, &ip_input);
	if( wg_netif == nullptr ) {
		UNLOCK_TCPIP_CORE();
		log_e(TAG "failed to initialize WG netif.");
		return false;
	}
	// Mark the interface as administratively up, link up flag is set automatically when peer connects
	netif_set_up(wg_netif);

	peer.public_key = remotePeerPublicKey;
	peer.preshared_key = NULL;
	// Allow all IPs through tunnel
    {
        ip_addr_t allowed_ip = IPADDR4_INIT_BYTES(0, 0, 0, 0);
        peer.allowed_ip = allowed_ip;
        ip_addr_t allowed_mask = IPADDR4_INIT_BYTES(0, 0, 0, 0);
        peer.allowed_mask = allowed_mask;
    }
	
	peer.endport_port = remotePeerPort;

    // Initialize the platform
    wireguard_platform_init();
	// Register the new WireGuard peer with the netwok interface
	wireguardif_add_peer(wg_netif, &peer, &wg_peer_index);
	if ((wg_peer_index != WIREGUARDIF_INVALID_INDEX) && !ip_addr_isany(&peer.endpoint_ip)) {
		// Start outbound connection to peer
        log_i(TAG "connecting wireguard...");
		wireguardif_connect(wg_netif, wg_peer_index);
		// Save the current default interface for restoring when shutting down the WG interface.
		previous_default_netif = netif_default;
		// Set default interface to WG device.
        netif_set_default(wg_netif);
	}

	this->_is_initialized = true;
	UNLOCK_TCPIP_CORE();
	return true;
}

void WireGuard::end() {
	if( !this->_is_initialized ) return;

	LOCK_TCPIP_CORE();

	// Restore the default interface.
	netif_set_default(previous_default_netif);
	previous_default_netif = nullptr;
	// Disconnect the WG interface.
	wireguardif_disconnect(wg_netif, wg_peer_index);
	// Remove peer from the WG interface
	wireguardif_remove_peer(wg_netif, wg_peer_index);
	wg_peer_index = WIREGUARDIF_INVALID_INDEX;
	// Shutdown the wireguard interface.
	wireguardif_shutdown(wg_netif);
	// Remove the WG interface;
	netif_remove(wg_netif);
	wg_netif = nullptr;

	this->_is_initialized = false;
	UNLOCK_TCPIP_CORE();
}
bool WireGuard::is_peer_up() const {
	if (!this->_is_initialized || wg_netif == nullptr || wg_peer_index == WIREGUARDIF_INVALID_INDEX) return false;
	return wireguardif_peer_is_up(wg_netif, wg_peer_index, NULL, NULL) == ERR_OK;
}

bool WireGuard::get_peer_endpoint(IPAddress& address, uint16_t& port) const {
	if (!this->_is_initialized || wg_netif == nullptr || wg_peer_index == WIREGUARDIF_INVALID_INDEX) return false;

	ip_addr_t current_ip = IPADDR4_INIT_BYTES(0, 0, 0, 0);
	u16_t current_port = 0;
	if (wireguardif_peer_is_up(wg_netif, wg_peer_index, &current_ip, &current_port) != ERR_OK) return false;

	const uint32_t raw = current_ip.u_addr.ip4.addr;
	address = IPAddress(
		(raw >> 0) & 0xff,
		(raw >> 8) & 0xff,
		(raw >> 16) & 0xff,
		(raw >> 24) & 0xff);
	port = current_port;
	return true;
}

uint32_t WireGuard::session_age_ms() const {
	if (!this->_is_initialized || wg_netif == nullptr || wg_peer_index == WIREGUARDIF_INVALID_INDEX) return UINT32_MAX;
	struct wireguard_device *device = (struct wireguard_device *)wg_netif->state;
	if (device == nullptr) return UINT32_MAX;
	struct wireguard_peer *peer = peer_lookup_by_peer_index(device, wg_peer_index);
	if (peer == nullptr) return UINT32_MAX;
	uint32_t now = wireguard_sys_now();
	if (peer->curr_keypair.valid) return now - peer->curr_keypair.keypair_millis;
	if (peer->prev_keypair.valid) return now - peer->prev_keypair.keypair_millis;
	return UINT32_MAX;
}
